docs/inclass02A.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-07 Wed 16:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 In Class Exercise Number 2A</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org-orig.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 In Class Exercise Number 2A</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2a87721">1. Instructions</a></li>
<li><a href="#orgc73c00b">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2a87721" class="outline-2">
<h2 id="org2a87721"><span class="section-number-2">1</span> Instructions</h2>
<div class="outline-text-2" id="text-1">
<p>
Consider a simple generic <code>Queue</code> implementation.
</p>
<div class="org-src-container">
<pre class="src src-java">
<span style="color: #859900; font-weight: bold;">public</span> <span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900; font-style: italic;">Queue</span> &lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; {

   <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">List</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt; <span style="color: #268bd2;">elements</span>;
   <span style="color: #859900; font-weight: bold;">private</span> <span style="color: #b58900; font-style: italic;">int</span> <span style="color: #268bd2;">size</span>;

   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900;">Queue</span>() {   
      <span style="color: #859900; font-weight: bold;">this</span>.elements = <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">ArrayList</span>&lt;<span style="color: #b58900; font-style: italic;">E</span>&gt;();
      <span style="color: #859900; font-weight: bold;">this</span>.size = 0;
   }

   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">void</span> <span style="color: #b58900;">enQueue</span> (<span style="color: #b58900; font-style: italic;">E</span> <span style="color: #268bd2;">e</span>) {
     elements.add(e);
     size++;
   }

   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">E</span> <span style="color: #b58900;">deQueue</span> () {
     <span style="color: #859900; font-weight: bold;">if</span> (size == 0) <span style="color: #859900; font-weight: bold;">throw</span> <span style="color: #859900; font-weight: bold;">new</span> <span style="color: #b58900; font-style: italic;">IllegalStateException</span>(<span style="color: #2aa198;">"Queue.deQueue"</span>);
     <span style="color: #b58900; font-style: italic;">E</span> <span style="color: #268bd2;">result</span> = elements.get(0);
     elements.remove(0);
     size--;
     <span style="color: #859900; font-weight: bold;">return</span> result;
   }

   <span style="color: #859900; font-weight: bold;">public</span> <span style="color: #b58900; font-style: italic;">boolean</span> <span style="color: #b58900;">isEmpty</span>() {
      <span style="color: #859900; font-weight: bold;">return</span> size == 0;
   }
}

</pre>
</div>

<ol class="org-ol">
<li>Rewrite <code>Queue</code> to be <b>immutable</b>. Keep the representation variables <code>elements</code> and <code>size</code>.</li>
<li>Do the right thing with <code>enQueue()</code>.</li>
<li>Do the right thing with <code>deQueue()</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-orgc73c00b" class="outline-2">
<h2 id="orgc73c00b"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
